---
kind: property
id: P:Autodesk.Revit.DB.ScheduleSortGroupField.SortOrder
source: html/16b75765-c3e7-1920-3270-0a9b63579357.htm
---
# Autodesk.Revit.DB.ScheduleSortGroupField.SortOrder Property

Indicates if elements in the schedule will be sorted in
 ascending or descending order.

## Syntax (C#)
```csharp
public ScheduleSortOrder SortOrder { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration